Documents/ПакетноеСозданиеИсходящейКорреспонденции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПакетноеСозданиеИсходящейКорреспонденции</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИсходящихПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тсВидыПечатныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияРПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонверта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесРПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектСформирован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокИсходящейКорреспонденции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИсходящаяКорреспонденция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПакетноеСозданиеИсходящейКорреспонденции/Ext/ObjectModule.bsl
Процедура ОбработкаУдаленияПроведения(Отказ)
	Для каждого стр из СписокИсходящейКорреспонденции Цикл
		КоррОбъект = Стр.ИсходящаяКорреспонденция.ПолучитьОбъект();
		КоррОбъект.ПометкаУдаления = Истина;
		Для каждого Ф из КоррОбъект.ПрикрепленныеФайлы Цикл
			ДокОбъект = Ф.ПрикрепленныйФайл.ПолучитьОбъект();
			ДокОбъект.РегистраторКорреспонденции = "";
			ДокОбъект.Записать();
		КонецЦикла;
		КоррОбъект.Записать();
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для каждого стр из СписокИсходящейКорреспонденции Цикл
		КоррОбъект = Стр.ИсходящаяКорреспонденция.ПолучитьОбъект();
		Если КоррОбъект.ПометкаУдаления = Истина Тогда
			КоррОбъект.ПометкаУдаления = Ложь;
			Для каждого Ф из КоррОбъект.ПрикрепленныеФайлы Цикл
				ДокОбъект = Ф.ПрикрепленныйФайл.ПолучитьОбъект();
				ДокОбъект.РегистраторКорреспонденции = Стр.ИсходящаяКорреспонденция;
				ДокОбъект.Записать();
			КонецЦикла;
			КоррОбъект.Записать();
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.СписокИсходящейКорреспонденции.Очистить();
	Для каждого стр из ЭтотОбъект.Объекты Цикл
		стр.КомплектСформирован = Ложь;
	КонецЦикла;	
КонецПроцедуры
